In [229]:
import pandas as pd
import numpy as np
import csv

d = {'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']}

# Pr1

In [187]:
#try1
df = pd.DataFrame(d,copy=True)
c=np.array(df)
for i in range(len(c)):
    try:
        ch = np.isnan(c[i][1]) 
    except:continue     
    if ch:
        c[i][1] = float(10045+10*i)
        
ds = pd.DataFrame(c,columns=df.columns)
ds

            From_To FlightNumber  RecentDelays              Airline
0      LoNDon_paris        10045      [23, 47]               KLM(!)
1      MAdrid_miLAN        10055            []    <Air France> (12)
2  londON_StockhOlm        10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis        10075          [13]       12. Air France
4   Brussels_londOn        10085      [67, 32]          "Swiss Air"

In [224]:
#try 2
df = pd.DataFrame(d)
for i in range(len(df['FlightNumber'])):  
    if pd.isnull(df['FlightNumber'][i]):
        df.loc[i,'FlightNumber'] = 10045+10*i#dfmi.loc[:, ('one', 'second')] = value
df['FlightNumber'] = df['FlightNumber'].astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [191]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [192]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
From_To         5 non-null object
FlightNumber    5 non-null int32
RecentDelays    5 non-null object
Airline         5 non-null object
dtypes: int32(1), object(3)
memory usage: 268.0+ bytes

In [193]:
p = df['From_To']
type(p)

pandas.core.series.Series

# Problem 2&3

In [225]:
sp = lambda x: x.split('_')
j = pd.DataFrame(list(map(sp,p)))
j[0],j[1]= j[0].str.capitalize(),j[1].str.capitalize()
df['From'],df['To'] = j[0],j[1]
df.drop(columns=['From_To'],inplace=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# Problem4

In [230]:
df1=df.copy()

In [231]:
def max_l(clm):
    p = len(clm[0])
    for i in range(len(clm)):
        if len(clm[i]) > p:
            p = len(clm[i])
    return p

In [233]:
for i in range(max_l(df1['RecentDelays'])):
    for j in range(len(df1['RecentDelays'])):
        try:
            df1.loc[j,'delay_'+str(i+1)]= df1['RecentDelays'][j][i]
        except:
            df1.loc[j,'delay_'+str(i+1)] = float('nan')

In [235]:
df = df1.drop(columns='RecentDelays',inplace=False)

In [236]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [237]:
pd.isnull(df1)

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,False,False,False,False,False,False,False,True
1,False,False,False,False,False,True,True,True
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,True,True
4,False,False,False,False,False,False,False,True